atarijookie/ce-atari/flash_stm32_2021/main.c
        if (npages) {
            num_pages = npages;
            end = flash_page_to_addr(first_page + num_pages);
            if (end > stm->dev->fl_end)
                end = stm->dev->fl_end;
        } else {
            end = stm->dev->fl_end;
            num_pages = flash_addr_to_page_ceil(end) - first_page;
        }

        if (!first_page && end == stm->dev->fl_end)
            num_pages = STM32_MASS_ERASE;
    }

    if (action == ACT_READ) {
        unsigned int max_len = port_opts.rx_frame_max;

        printf("Memory read\n");

        perr = parser->open(p_st, filename, 1);
        if (perr != PARSER_ERR_OK) {
            printf("%s ERROR: %s\n", parser->name, parser_errstr(perr));
            if (perr == PARSER_ERR_SYSTEM)
                perror(filename);
            goto close;
        }

        fflush(stdout);
        addr = start;
        while(addr < end) {
            uint32_t left   = end - addr;
            len     = max_len > left ? left : max_len;
            s_err = stm32_read_memory(stm, addr, buffer, len);
            if (s_err != STM32_ERR_OK) {
                printf("Failed to read memory at address 0x%08x, target write-protected?\n", addr);
                goto close;
            }
            if (parser->write(p_st, buffer, len) != PARSER_ERR_OK)
            {
                printf("Failed to write data to file\n");
                goto close;
            }
            addr += len;

            printf(
                "\rRead address 0x%08x (%.2f%%) ",
                addr,
                (100.0f / (float)(end - start)) * (float)(addr - start)
            );
            fflush(stdout);
        }
        printf(  "Done.\n");
        ret = 0;
        goto close;
    } else if (action == ACT_READ_PROTECT) {
        printf("Read-Protecting flash\n");
        /* the device automatically performs a reset after the sending the ACK */
        reset_flag = 0;
        s_err = stm32_readprot_memory(stm);
        if (s_err != STM32_ERR_OK) {
            printf("Failed to read-protect flash\n");
            goto close;
        }
        printf(  "Done.\n");
        ret = 0;
    } else if (action == ACT_READ_UNPROTECT) {
        printf("Read-UnProtecting flash\n");
        /* the device automatically performs a reset after the sending the ACK */
        reset_flag = 0;
        s_err = stm32_runprot_memory(stm);
        if (s_err != STM32_ERR_OK) {
            printf("Failed to read-unprotect flash\n");
            goto close;
        }
        printf(  "Done.\n");
        ret = 0;
    } else if (action == ACT_ERASE_ONLY) {
        ret = 0;
        printf("Erasing flash\n");

        if (num_pages != STM32_MASS_ERASE &&
            (start != flash_page_to_addr(first_page)
             || end != flash_page_to_addr(first_page + num_pages))) {
            printf("Specified start & length are invalid (must be page aligned)\n");
            ret = 1;
            goto close;
        }

        s_err = stm32_erase_memory(stm, first_page, num_pages);
        if (s_err != STM32_ERR_OK) {
            printf("Failed to erase memory\n");
            ret = 1;
            goto close;
        }
        ret = 0;
    } else if (action == ACT_WRITE_UNPROTECT) {
        printf("Write-unprotecting flash\n");
        /* the device automatically performs a reset after the sending the ACK */
        reset_flag = 0;
        s_err = stm32_wunprot_memory(stm);
        if (s_err != STM32_ERR_OK) {
            printf("Failed to write-unprotect flash\n");
            goto close;
        }
        printf(  "Done.\n");
        ret = 0;
    } else if (action == ACT_WRITE) {
        printf("Write to memory\n");

        unsigned int offset = 0;
        unsigned int r;
        unsigned int size;
        unsigned int max_wlen, max_rlen;

        max_wlen = port_opts.tx_frame_max - 2;  /* skip len and crc */
        max_wlen &= ~3; /* 32 bit aligned */

        max_rlen = port_opts.rx_frame_max;
        max_rlen = max_rlen < max_wlen ? max_rlen : max_wlen;

        /* Assume data from stdin is whole device */
        if (use_stdinout)
            size = end - start;
        else
            size = parser->size(p_st);

        // TODO: It is possible to write to non-page boundaries, by reading out flash
        //       from partial pages and combining with the input data
        // if ((start % stm->dev->fl_ps[i]) != 0 || (end % stm->dev->fl_ps[i]) != 0) {
        //  printf("Specified start & length are invalid (must be page aligned)\n");
        //  goto close;
        // }

        // TODO: If writes are not page aligned, we should probably read out existing flash
        //       contents first, so it can be preserved and combined with new data
        if (!no_erase && num_pages) {
            printf("Erasing memory\n");
            s_err = stm32_erase_memory(stm, first_page, num_pages);
            if (s_err != STM32_ERR_OK) {
                printf("Failed to erase memory\n");
                goto close;
            }
        }

        fflush(stdout);
        addr = start;
        while(addr < end && offset < size) {
            uint32_t left   = end - addr;
            len     = max_wlen > left ? left : max_wlen;
            len     = len > size - offset ? size - offset : len;

            if (parser->read(p_st, buffer, &len) != PARSER_ERR_OK)
                goto close;

            if (len == 0) {
                if (use_stdinout) {
                    break;
                } else {
                    printf("Failed to read input file\n");
                    goto close;
                }
            }

            again:
            s_err = stm32_write_memory(stm, addr, buffer, len);
            if (s_err != STM32_ERR_OK) {
                printf("Failed to write memory at address 0x%08x\n", addr);
                goto close;
            }

            if (verify) {
                uint8_t compare[len];
                unsigned int offset, rlen;

                offset = 0;
                while (offset < len) {
                    rlen = len - offset;
                    rlen = rlen < max_rlen ? rlen : max_rlen;
                    s_err = stm32_read_memory(stm, addr + offset, compare + offset, rlen);
                    if (s_err != STM32_ERR_OK) {
                        printf("Failed to read memory at address 0x%08x\n", addr + offset);
                        goto close;
                    }
                    offset += rlen;
                }

                for(r = 0; r < len; ++r)
                    if (buffer[r] != compare[r]) {
                        if (failed == retry) {
                            printf("Failed to verify at address 0x%08x, expected 0x%02x and found 0x%02x\n",
                                (uint32_t)(addr + r),
                                buffer [r],
                                compare[r]
                            );
                            goto close;
                        }
                        ++failed;
                        goto again;
                    }

                failed = 0;
            }

            addr    += len;
            offset  += len;

