atarijookie/ce-atari/flash_stm32_2021/main.c
            case 'g':
                exec_flag = 1;
                execute   = strtoul(optarg, NULL, 0);
                if (execute % 4 != 0) {
                    printf("ERROR: Execution address must be word-aligned\n");
                    return 1;
                }
                break;
            case 's':
                if (readwrite_len || start_addr) {
                    printf("ERROR: Invalid options, can't specify start page / num pages and start address/length\n");
                    return 1;
                }
                spage    = strtoul(optarg, NULL, 0);
                break;
            case 'S':
                if (spage || npages) {
                    printf("ERROR: Invalid options, can't specify start page / num pages and start address/length\n");
                    return 1;
                } else {
                    start_addr = strtoul(optarg, &pLen, 0);
                    if (start_addr % 4 != 0) {
                        printf("ERROR: Start address must be word-aligned\n");
                        return 1;
                    }
                    /* we decode 0 as 1 (which is unaligned and thus invalid anyway)
                     * to flag that it was set by the user */
                    if (pLen != optarg && start_addr == 0)
                        start_addr = 1;
                    if (*pLen == ':') {
                        pLen++;
                        readwrite_len = strtoul(pLen, NULL, 0);
                        if (readwrite_len == 0) {
                            printf("ERROR: Invalid options, can't specify zero length\n");
                            return 1;
                        }
                    }
                }
                break;
            case 'F':
                port_opts.rx_frame_max = strtoul(optarg, &pLen, 0);
                if (*pLen == ':') {
                    pLen++;
                    port_opts.tx_frame_max = strtoul(pLen, NULL, 0);
                }
                if (port_opts.rx_frame_max < 0
                    || port_opts.tx_frame_max < 0) {
                    printf("ERROR: Invalid negative value for option -F\n");
                    return 1;
                }
                if (port_opts.rx_frame_max == 0)
                    port_opts.rx_frame_max = STM32_MAX_RX_FRAME;
                if (port_opts.tx_frame_max == 0)
                    port_opts.tx_frame_max = STM32_MAX_TX_FRAME;
                if (port_opts.rx_frame_max < 20
                    || port_opts.tx_frame_max < 6) {
                    printf("ERROR: current code cannot work with small frames.\n");
                    printf("min(RX) = 20, min(TX) = 6\n");
                    return 1;
                }
                if (port_opts.rx_frame_max > STM32_MAX_RX_FRAME) {
                    printf("WARNING: Ignore RX length in option -F\n");
                    port_opts.rx_frame_max = STM32_MAX_RX_FRAME;
                }
                if (port_opts.tx_frame_max > STM32_MAX_TX_FRAME) {
                    printf("WARNING: Ignore TX length in option -F\n");
                    port_opts.tx_frame_max = STM32_MAX_TX_FRAME;
                }
                break;
            case 'f':
                force_binary = 1;
                break;

            case 'c':
                init_flag = 0;
                break;

            case 'h':
                show_help(argv[0]);
                exit(0);

            case 'i':
                gpio_seq = optarg;
                break;

            case 'R':
                reset_flag = 1;
                break;

            case 'C':
                if (action != ACT_NONE) {
                    err_multi_action(ACT_CRC);
                    return 1;
                }
                action = ACT_CRC;
                break;
        }
    }

    for (c = optind; c < argc; ++c) {
        if (port_opts.device) {
            printf("ERROR: Invalid parameter specified\n");
            show_help(argv[0]);
            return 1;
        }
        port_opts.device = argv[c];
    }

    if (port_opts.device == NULL) {
        printf("ERROR: Device not specified\n");
        show_help(argv[0]);
        return 1;
    }

    if ((action != ACT_WRITE) && verify) {
        printf("ERROR: Invalid usage, -v is only valid when writing\n");
        show_help(argv[0]);
        return 1;
    }

    return 0;
}

void show_help(char *name) {
    printf(
        "Usage: %s [-bvngfhc] [-[rw] filename] tty_device\n"
        "   -x flash Hans\n"
        "   -y flash Franz\n"
        "   -b rate     Baud rate (default 57600)\n"
        "   -m mode     Serial port mode (default 8e1)\n"
        "   -r filename Read flash to file (or - stdout)\n"
        "   -w filename Write flash from file (or - stdout)\n"
        "   -C      Compute CRC of flash content\n"
        "   -u      Disable the flash write-protection\n"
        "   -j      Enable the flash read-protection\n"
        "   -k      Disable the flash read-protection\n"
        "   -o      Erase only\n"
        "   -e n    Only erase n pages before writing the flash\n"
        "   -v      Verify writes\n"
        "   -n count    Retry failed writes up to count times (default 10)\n"
        "   -g address  Start execution at specified address (0 = flash start)\n"
        "   -S address[:length] Specify start address and optionally length for\n"
        "                       read/write/erase operations\n"
        "   -F RX_length[:TX_length]  Specify the max length of RX and TX frame\n"
        "   -s start_page   Flash at specified page (0 = flash start)\n"
        "   -f      Force binary parser\n"
        "   -h      Show this help\n"
        "   -c      Resume the connection (don't send initial INIT)\n"
        "           *Baud rate must be kept the same as the first init*\n"
        "           This is useful if the reset fails\n"
        "   -R      Reset device at exit.\n", name
    );
}

